{"backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 100], "dtype": "float32"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "output_dim": 50, "input_length": null, "input_dim": 20000, "embeddings_constraint": null, "mask_zero": false, "name": "embedding_1", "embeddings_regularizer": null, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "activity_regularizer": null}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bidirectional_1", "config": {"merge_mode": "concat", "trainable": true, "layer": {"config": {"return_state": false, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_1", "go_backwards": false, "kernel_constraint": null, "return_sequences": true, "dropout": 0.1, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.1, "bias_constraint": null, "implementation": 0, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 50, "unit_forget_bias": true, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "activity_regularizer": null}, "class_name": "LSTM"}, "name": "bidirectional_1"}, "class_name": "Bidirectional", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.1, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["bidirectional_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"beta_constraint": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "center": true, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "beta_regularizer": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "lstm_2", "config": {"return_state": false, "bias_regularizer": null, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_regularizer": null, "use_bias": true, "recurrent_regularizer": null, "name": "lstm_2", "go_backwards": false, "kernel_constraint": null, "return_sequences": false, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "bias_constraint": null, "implementation": 0, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 50, "unit_forget_bias": true, "recurrent_constraint": null, "activation": "tanh", "stateful": false, "activity_regularizer": null}, "class_name": "LSTM", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"name": "dropout_2", "rate": 0.1, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"name": "dense_1", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "name": "dense_1", "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "units": 50, "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "dense_2", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "name": "dense_2", "bias_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "units": 6, "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "keras_version": "2.0.8"}